"""This module provides texts for bot messages."""

CROSS_MARK = "✖️"
CHECK_MARK = "✔️"

OOPS = \
    "Oops. Щось пішло не так. Спробуйте пізніше. 😔"

HELP_TEXT = \
    "Sheet Without Shit - помічник з питань бюджету 💲." \
    "\n\nЯ створений для того, щоб заощадити Ваші кошти." \
    " Метод, на якому базується функціонал боту, називається - Poor-Man's Budgeting." \
    "\n\nВ мої обов'язки входить:" \
    "\n\t▪ Аналіз ваших транзакцій MonoBank`у." \
    "\n\t▪ Візуалізаця бюджету за допомогою Google Spreadsheet." \
    "\n\t▪️ Щотижневі/щомісячні звіти про Ваш бюджет." \
    "\n\t▪ Щоденне оповіщення про витрати сьогоднішнього дня та доступні кошти на наступний день." \
    "\n\t▪ Оповіщення про кожну виконану транзакцію (/notification_on)." \
    "\n\n\nЗовнішні сервіси:" \
    "\n\t▪ MonoBank 🏦 - після активації доступу, я зможу отримувати інформацію про Ваші витрати," \
    " що дозволить мені аналізувати та створювати звіти про Ваш бюджет." \
    " Для того, щоб активувати зверніться до команди /monobank." \
    "\n\t▪ Google Spreadsheet📈 - після активації доступу, я зможу створити Poor-Man's Budgeting Spreadsheet." \
    " Для того, щоб активувати зверніться до команди /spreadsheet."

START_TEXT = \
    "Вітаю у Sheet Without Shit! 💲" \
    "\n\nЯ буду допомагати Вам заощаджувати кошти." \
    " Аби розпочати повноцінну взаємодію, " \
    "Вам потрібно активувати доступ до:" \
    "\n\t▪ MonoBank (/monobank)." \
    "\n\t▪ Google Spreadsheet (/spreadsheet)." \
    "\n\nДля детальнішої інформації звертайтесь до команди /help."

USER_INFO = \
    "Вітаю, {first_name} {last_name}! 💲\n\n" \
    "{notifications_mark} - Нотифікації про виконані транзакції.\n" \
    "{spreadsheet_mark} - Посилання на [таблицю бюджету](https://docs.google.com/spreadsheets/d/{spreadsheet_id}).\n\n"\
    "{monobank_mark} - Наданий доступ до MonoBank'у. (/monobank)\n" \
    "{spreadsheet_token_mark} - Наданий доступ до Google Spreadsheet. (/spreadsheet)"

SPREADSHEET_AUTH = \
    "Щоб я зміг створити електрону таблицю, вам потрібно перейти за [посиланням]({auth_url})" \
    " та підтвердити надання доступу." \
    " Код доступу відправте мені одразу ж після цього повідомлення."

SPREADSHEET_AUTH_SUCCESS = \
    "Доступ успішно наданий. Дякую!" \
    " Згодом ви зможете користуватись електроною таблицей під назвою \"Sheet Without Shit\". 💲"

MONOBANK_AUTH = \
    "Щоб я зміг отримувати інформацію про виписки та стан Вашого особистого рахунку," \
    " Вам потрібно пройти авторизацію у [особистому кабінеті](https://api.monobank.ua/)" \
    " та отриманий токен відправити мені одразу ж після цього повідомлення."

MONOBANK_AUTH_SUCCESS = \
    "Доступ успішно наданий. Дякую! 💲"

NOTIFICATION_ACTIONS = \
    "Нотифікації про виконані транзакції були успішно {action}. 🎶"
