"""This module provides texts for bot messages."""

HELP_TEXT = \
    "Sheet Without Shit - помічник з питань бюджету 💲." \
    "\n\nЯ створений для того, щоб заощадити Ваші кошти." \
    " Метод, на якому базується функціонал боту, називається - Poor-Man's Budgeting." \
    "\n\nВ мої обов'язки входить:" \
    "\n\t▪ Аналіз ваших транзакцій MonoBank`у." \
    "\n\t▪ Візуалізаця бюджету за допомогою Google Spreadsheet." \
    "\n\t▪️ Щотижневі/щомісячні звіти про Ваш бюджет." \
    "\n\t▪ Щоденне оповіщення про витрати сьогоднішнього дня та доступні кошти на наступний день." \
    "\n\n\nЗовнішні сервіси:" \
    "\n\t▪ MonoBank 🏦 - після активації доступу, я зможу отримувати інформацію про Ваші витрати," \
    " що дозволить мені аналізувати та створювати звіти про Ваш бюджет." \
    " Для того, щоб активувати зверніться до команди /monobank." \
    "\n\t▪ Google Spreadsheet📈 - після активації доступу, я зможу створити Poor-Man's Budgeting Spreadsheet." \
    " Для того, щоб активувати зверніться до команди /spreadsheet."


START_TEXT = \
    "Вітаю у Sheet Without Shit! 💲" \
    "\n\nЯ буду допомагати Вам заощаджувати кошти." \
    " Аби розпочати повноцінну взаємодію, " \
    "Вам потрібно активувати доступ до:" \
    "\n\t▪ MonoBank (/monobank)." \
    "\n\t▪ Google Spreadsheet (/spreadsheet)." \
    "\n\nДля детальнішої інформації звертайтесь до команди /help."
